bluekitchen/btstack/port/nrf5-cinnamon/port/ll_nrf5.c
static struct {

    volatile bool     synced;

    volatile uint16_t packet_nr_in_connection_event;

    volatile uint16_t conn_interval_1250us;
    volatile uint32_t conn_interval_us;
    volatile uint16_t conn_interval_ticks;

    volatile uint16_t conn_latency;

    volatile uint16_t supervision_timeout_10ms;
    volatile uint32_t supervision_timeout_us;

    //
    volatile uint32_t time_without_any_packets_us;

    // access address
    volatile uint32_t aa;

    // start of current connection event
    volatile uint32_t anchor_ticks;

    // custom anchor delta to apply on next sync hop (if != 0)
    volatile uint16_t anchor_delta_ticks;

    // latest time to send tx packet before sync hop
    volatile uint16_t conn_latest_tx_ticks;

    // timeout for sync relative to anchor
    volatile uint16_t conn_sync_hop_ticks;

    // current channel
    volatile uint8_t  channel;

    // CSA #2 supported
    uint8_t csa2_support;

    // channels selection algorithm index (1 for csa #2)
    volatile uint8_t channel_selection_algorithm;

    // current connection event, first one starts with 0
    // - needed for connection param and channel map updates as well as encryption
    volatile uint16_t connection_event;

    // pending channel map update
    volatile bool     channel_map_update_pending;
    volatile uint16_t channel_map_update_instant;
    volatile uint8_t  channel_map_update_map[5];

    // pending connection param update
    volatile bool     conn_param_update_pending;
    volatile uint16_t conn_param_update_instant;
    volatile uint8_t  conn_param_update_win_size;
    volatile uint16_t conn_param_update_win_offset;
    volatile uint16_t conn_param_update_interval_1250us;
    volatile uint16_t conn_param_update_latency;
    volatile uint32_t conn_param_update_timeout_us;

    // our bd_addr as little endian
    uint8_t bd_addr_le[6];

    // peer addr
    uint8_t peer_addr_type;
    uint8_t peer_addr[6];

    // adv data
    uint8_t adv_len;
    uint8_t adv_data[31];

    // adv param
    uint8_t  adv_map;
    uint32_t adv_interval_us;
    uint8_t  adv_type;

    // adv data
    uint8_t scan_resp_len;
    uint8_t scan_resp_data[31];

    // transmit window size in us
    volatile uint32_t transmit_window_size_us;

    // transmit window offset in us
    volatile uint32_t transmit_window_offset_us;

    // next expected sequence number
    volatile uint8_t next_expected_sequence_number;

    // transmit sequence number
    volatile uint8_t transmit_sequence_number;

    // remote active: more data or non-empty packet
    volatile bool remote_active;


    // rx queue
    btstack_linked_queue_t rx_queue;

    // current incoming packet
    ll_pdu_t * rx_pdu;

    // tx queue of outgoing pdus
    btstack_linked_queue_t tx_queue;

    // current outgoing packet
    ll_pdu_t * tx_pdu;

    // num completed packets
    volatile uint8_t num_completed;

    // used for controller events
    volatile uint8_t error_code;

    volatile bool ll_send_disconnected;

    volatile bool ll_send_connection_complete;

} ctx;

// Buffer pool
static ll_pdu_t ll_pdu_pool_storage[MAX_NUM_LL_PDUS];
static btstack_memory_pool_t ll_pdu_pool;

// prepared adv + scan packets
static uint8_t adv_packet_data[39];
static uint8_t adv_packet_len;
static uint8_t scan_packet_data[39];
static uint8_t scan_packet_len;

// single ll empty pdu
static uint8_t ll_empty_pdu[2];

// single ll control response
static ll_pdu_t ll_tx_packet;

// Link Layer State
static ll_state_t ll_state;
static uint32_t ll_scan_interval_us;
static uint32_t ll_scan_window_us;

static ll_pdu_t * ll_reserved_acl_buffer;

// Controller interface
static uint8_t ll_outgoing_hci_event[258];
static void (*controller_packet_handler)(uint8_t packet_type, uint8_t * packet, uint16_t size);

// Memory Pool for acl-le pdus

static ll_pdu_t * btstack_memory_ll_pdu_get(void){
    void * buffer = btstack_memory_pool_get(&ll_pdu_pool);
    if (buffer){
        memset(buffer, 0, sizeof(ll_pdu_t));
    }
    return (ll_pdu_t *) buffer;
}

static void btstack_memory_ll_pdu_free(ll_pdu_t *acl_le_pdu){
    btstack_memory_pool_free(&ll_pdu_pool, acl_le_pdu);
}

// Link Layer

// prototypes

static bool ll_prepare_rx_buffer(void){
    if (ctx.rx_pdu == NULL){
        ctx.rx_pdu = btstack_memory_ll_pdu_get();
    }
    if (ctx.rx_pdu == NULL){
        printf("No free RX buffer\n");
        return false;
    } else {
        return true;
    }
}

static void ll_stop_timer(void){
    hal_timer_stop();
}

static void ll_set_timer_ticks(uint32_t anchor_offset_ticks){
    ll_stop_timer();
    // set timer for next radio event relative to anchor
    uint32_t timeout_ticks = ctx.anchor_ticks + anchor_offset_ticks;
    hal_timer_start(timeout_ticks);
}

// preamble (1) + aa (4) + header (1) + len (1) + payload (len) + crc (3) -- ISR handler ca. 5 us (educated guess)
static uint32_t ll_start_ticks_for_end_time_and_len(uint32_t packet_end_ticks, uint16_t len){
    uint32_t timestamp_delay = (10 + len) * 8 - 5;
    uint32_t packet_start_ticks = packet_end_ticks - US_TO_TICKS(timestamp_delay);
    return packet_start_ticks;
}

static void ll_emit_hci_event(const hci_event_t * event, ...){
    va_list argptr;
    va_start(argptr, event);
    uint16_t length = hci_event_create_from_template_and_arglist(ll_outgoing_hci_event, event, argptr);
    va_end(argptr);
    controller_packet_handler(HCI_EVENT_PACKET, ll_outgoing_hci_event, length);
}

// ll adv prototypes

static void ll_advertising_timer_handler(void);
static void ll_advertising_tx_done(radio_result_t result);
static void ll_advertising_tx_to_rx(radio_result_t result);

static void ll_advertising_statemachine(void){
    // find next channel
    while (ctx.channel < 40){
        ctx.channel++;
        if ((ctx.adv_map & (1 << (ctx.channel - 37))) != 0) {
            // Set Channel
            radio_set_channel(ctx.channel);
            // Expect response?
            radio_transition_t transition;
            radio_callback_t callback;
            if (ctx.adv_type == 3){
                // Non connectable undirected advertising (ADV_NONCONN_IND)
                transition = RADIO_TRANSITION_TX_ONLY;
                callback = &ll_advertising_tx_done;
            } else {
                // All other are either connectable and/or scannable
                transition = RADIO_TRANSITION_TX_TO_RX;
                callback = &ll_advertising_tx_to_rx;
            }
            // log_info("Send adv on #%u", ctx.channel);
            radio_transmit(callback, transition, adv_packet_data, adv_packet_len);
            break;
        }
        // adv sent on all active channels
        if (ctx.channel >= 40){
            // Disable HF Clock
            radio_hf_clock_disable();

            // Set timer
            uint32_t adv_interval_ticks = US_TO_TICKS(ctx.adv_interval_us);
            hal_timer_set_callback(&ll_advertising_timer_handler);
            ll_set_timer_ticks(adv_interval_ticks);
        }
    }
}

static void ll_advertising_tx_done(radio_result_t result){
    UNUSED(result);
    ll_advertising_statemachine();
}

static void ll_advertising_disabled(radio_result_t result){
    UNUSED(result);
    ll_advertising_statemachine();
}

static void ll_advertising_conn_ind_received(radio_result_t result){
    UNUSED(result);
    ll_pdu_t * rx_packet = ctx.rx_pdu;
    // packet used
    ctx.rx_pdu = NULL;
    // mark as adv packet
    rx_packet->flags = 0;
    // queue received packet -> ll_execute_once
    btstack_linked_queue_enqueue(&ctx.rx_queue, (btstack_linked_item_t *) rx_packet);
}

static void ll_advertising_rx_done(radio_result_t result){
    uint8_t pdu_type;
    switch (result){
        case RADIO_RESULT_OK:
            // check for Scan and Connect requests
            pdu_type = ctx.rx_pdu->header & 0x0f;
            switch (pdu_type){
                case PDU_ADV_TYPE_SCAN_REQ:
                    switch (ctx.adv_type) {
                        case 3:
                            // ignore for ADV_NONCONN_IND
                            radio_stop(&ll_advertising_disabled);
                            break;
                         default:
                            radio_transmit(&ll_advertising_tx_done, RADIO_TRANSITION_TX_ONLY, scan_packet_data, scan_packet_len);
                            break;
                    }
                    break;
                case PDU_ADV_TYPE_CONNECT_IND:
                    switch (ctx.adv_type){
                        case 2: // ADV_SCAN_IND
                        case 3: // ADV_NONCONN_IND
                            radio_stop(&ll_advertising_disabled);
                            break;
                        default:
                            // store ticks as anchor
                            ctx.anchor_ticks = hal_timer_get_ticks();
                            // stop radio and
                            radio_stop(&ll_advertising_conn_ind_received);
                            break;
                    }
                    break;
                default:
                    radio_stop(&ll_advertising_disabled);
                    break;
            }
            break;
        case RADIO_RESULT_TIMEOUT:
            ll_advertising_statemachine();
            break;
        case RADIO_RESULT_CRC_ERROR:
            radio_stop(&ll_advertising_disabled);
            break;
        default:
            btstack_assert(false);
            break;
    }
}

static void ll_advertising_tx_to_rx(radio_result_t result){
    UNUSED(result);
    if (ll_prepare_rx_buffer()){
        radio_receive(&ll_advertising_rx_done, TX_TO_RX_TIMEOUT_US, &ctx.rx_pdu->header, 2 + LL_MAX_PAYLOAD, NULL);
    } else {
        // TODO: stop radio
        btstack_assert(false);
    }
}

static void ll_advertising_timer_handler(void){

    uint32_t t0 = hal_timer_get_ticks();

