bluekitchen/btstack/port/nrf5-cinnamon/port/ll_nrf5.c
    // enable HF Clock
    radio_hf_clock_enable(true);

    // send adv on all configured channels
    ctx.channel = 36;
    ctx.anchor_ticks = t0;
    ll_advertising_statemachine();
}

static uint16_t ll_advertising_setup_pdu(uint8_t * buffer, uint8_t header, uint8_t len, const uint8_t * data){
    buffer[0] = header;
    buffer[1] = 6 + len;
    memcpy(&buffer[2], ctx.bd_addr_le, 6);
    memcpy(&buffer[8], data, len);
    uint16_t packet_size = 2 + buffer[1];
    return packet_size;
}

static uint8_t ll_advertising_start(void){
    // COMMAND DISALLOWED if wrong state.
    if (ll_state != LL_STATE_STANDBY) return ERROR_CODE_COMMAND_DISALLOWED;
    log_info("Start Advertising on channels 0x%0x, interval %lu us", ctx.adv_map, ctx.adv_interval_us);

    radio_set_access_address(ADVERTISING_RADIO_ACCESS_ADDRESS);
    radio_set_crc_init(ADVERTISING_CRC_INIT);

    ll_state = LL_STATE_ADVERTISING;

    // prepare adv and scan data in tx0 and tx1
    enum pdu_adv_type adv_type;
    switch (ctx.adv_type){
        case 0:
            // Connectable and scannable undirected advertising
            adv_type = PDU_ADV_TYPE_ADV_IND;
            break;
        case 1:
            // Connectable high duty cycle directed advertising
            adv_type = PDU_ADV_TYPE_DIRECT_IND;
            break;
        case 2:
            // Scannable undirected advertising (ADV_SCAN_IND);
            adv_type = PDU_ADV_TYPE_SCAN_IND;
            break;
        case 3:
            // Non connectable undirected advertising (ADV_NONCONN_IND)
            adv_type = PDU_ADV_TYPE_NONCONN_IND;
            break;
        case 4:
            // Connectable low duty cycle directed advertising
            adv_type = PDU_ADV_TYPE_DIRECT_IND;
            break;
        default:
            adv_type = PDU_ADV_TYPE_ADV_IND;
            break;
    }
    adv_packet_len  = ll_advertising_setup_pdu(adv_packet_data, adv_type,  ctx.adv_len,       ctx.adv_data);
    scan_packet_len = ll_advertising_setup_pdu(scan_packet_data, PDU_ADV_TYPE_SCAN_RSP, ctx.scan_resp_len, ctx.scan_resp_data);

    ctx.channel = 36;
    ctx.anchor_ticks = hal_timer_get_ticks();

    // and get started
    radio_hf_clock_enable(true);
    ll_advertising_statemachine();

    return ERROR_CODE_SUCCESS;
}

static uint8_t ll_advertising_stop(void){
    // COMMAND DISALLOWED if wrong state.
    if (ll_state != LL_STATE_ADVERTISING) return ERROR_CODE_COMMAND_DISALLOWED;

    // TODO:
    return ERROR_CODE_SUCCESS;
}

// ll scanning

static void ll_scanning_statemachine(void);

static void ll_scanning_for_window(void){
    radio_hf_clock_enable(true);
    // next channel
    ctx.channel++;
    if (ctx.channel >= 40){
        ctx.channel = 37;
    }
    radio_set_channel(ctx.channel);
    ctx.anchor_ticks = hal_timer_get_ticks();
    log_info("Scan channel %u", ctx.channel);
    ll_scanning_statemachine();
}

static void ll_scanning_tx_interrupted(radio_result_t result){
    UNUSED(result);
    ll_scanning_statemachine();
}

static void ll_scanning_rx_done(radio_result_t result){
    ll_pdu_t * rx_packet;
    switch (result){
        case RADIO_RESULT_OK:
            rx_packet = ctx.rx_pdu;
            btstack_assert(rx_packet != NULL);
            // packet used
            ctx.rx_pdu = NULL;
            // mark as adv packet
            rx_packet->flags = 0;
            // queue received packet
            btstack_linked_queue_enqueue(&ctx.rx_queue, (btstack_linked_item_t *) rx_packet);
            // stop rx->tx transition
            radio_stop(&ll_scanning_tx_interrupted);
            break;
        case RADIO_RESULT_CRC_ERROR:
            // stop rx->tx transition
            radio_stop(&ll_scanning_tx_interrupted);
            break;
        case RADIO_RESULT_TIMEOUT:
            ll_scanning_statemachine();
            break;
        default:
            break;
    }
}

static void ll_scanning_statemachine(void){
    uint32_t now =  hal_timer_get_ticks();
    uint32_t scanning_active_ticks = now - ctx.anchor_ticks;
    uint32_t scanning_active_us    = (scanning_active_ticks * 70) / 2;

    ll_prepare_rx_buffer();

    if ((scanning_active_us < ll_scan_window_us) && (ctx.rx_pdu != NULL)){
        uint32_t scan_interval_remaining_us = ll_scan_window_us - scanning_active_us;
        // start receiving
        radio_receive(&ll_scanning_rx_done, scan_interval_remaining_us, &ctx.rx_pdu->header, 2 + LL_MAX_PAYLOAD, &ctx.rx_pdu->rssi);
    } else {
        // scan window over or no buffer

        // disable radio if there is enough time
        uint32_t pause_us = ll_scan_interval_us - scanning_active_us;
        if (pause_us < 500){
            // almost 100% scanning, keep hf clock on
            ll_scanning_for_window();
        } else {
            radio_hf_clock_disable();
            hal_timer_set_callback(&ll_scanning_for_window);
            hal_timer_start(now + US_TO_TICKS(pause_us));
        }
    }
}

static uint8_t ll_scanning_start(uint8_t filter_duplicates){

    // COMMAND DISALLOWED if wrong state.
    if (ll_state != LL_STATE_STANDBY)  return ERROR_CODE_COMMAND_DISALLOWED;

    ll_state = LL_STATE_SCANNING;
    ctx.channel = 36;

    radio_set_access_address(ADVERTISING_RADIO_ACCESS_ADDRESS);
    radio_set_crc_init(ADVERTISING_CRC_INIT);

    log_info("LE Scan Start: window %lu, interval %lu ms", ll_scan_interval_us, ll_scan_window_us);

    ll_scanning_for_window();

    return ERROR_CODE_SUCCESS;
}

static void ll_scanning_stop_done(radio_result_t result){
    UNUSED(result);
    ll_state = LL_STATE_STANDBY;
    radio_hf_clock_disable();
}

static uint8_t ll_scanning_stop(void){
    // COMMAND DISALLOWED if wrong state.
    if (ll_state != LL_STATE_SCANNING)  return 0x0c;

    // TODO: post-pone result until scanning actually stopped
    log_info("LE Scan Stop");

    // stop radio
    radio_stop(&ll_scanning_stop_done);
    return ERROR_CODE_SUCCESS;
}

// ll connected

static bool ll_connected_one_more_packet(void){
    uint32_t now = hal_timer_get_ticks();
    int32_t connection_ticks = now - ctx.anchor_ticks;
    return connection_ticks < ctx.conn_latest_tx_ticks;
}

static void ll_connected_next_channel(void){
    switch (ctx.channel_selection_algorithm){
        case 0:
            ctx.channel = hopping_csa1_get_next_channel( &h );
            break;
        case 1:
            ctx.channel = hopping_csa2_get_channel_for_counter( &h,  ctx.connection_event);
            break;
        default:
            break;
    }
    radio_set_channel(ctx.channel);
}

static void ll_connected_ctx_set_conn_interval(uint16_t conn_interval_1250us){
    ctx.conn_interval_1250us = conn_interval_1250us;
    ctx.conn_interval_us     = ctx.conn_interval_1250us * 1250;
    ctx.conn_interval_ticks  = US_TO_TICKS(ctx.conn_interval_us);
    ctx.conn_sync_hop_ticks  = US_TO_TICKS(ctx.conn_interval_us - SYNC_HOP_DELAY_US);

    // latest time to send a packet before getting ready for next cnonection event
    uint16_t max_packet_time_incl_ifs_us = 500;
    ctx.conn_latest_tx_ticks = US_TO_TICKS(ctx.conn_interval_us - SYNC_HOP_DELAY_US - max_packet_time_incl_ifs_us);
}

static void ll_connected_terminate(uint8_t error_code){
    ll_state = LL_STATE_STANDBY;
    ctx.conn_param_update_pending = false;
    ctx.channel_map_update_pending = false;
    // turn off clock
    radio_hf_clock_disable();
    // stop sync hop timer
    ll_stop_timer();
    // free outgoing tx packets
    if ((ctx.tx_pdu != NULL) && (ctx.tx_pdu != &ll_tx_packet)){
        btstack_memory_ll_pdu_free(ctx.tx_pdu);
        ctx.tx_pdu = NULL;
    }
    // free queued tx packets
    while (true){
        ll_pdu_t * tx_packet = (ll_pdu_t *) btstack_linked_queue_dequeue(&ctx.tx_queue);
        if (tx_packet != NULL) {
            btstack_memory_ll_pdu_free(tx_packet);
        } else {
            break;
        }
    }
    // notify host stack
    ctx.error_code = error_code;
    ctx.ll_send_disconnected = true;
}

