bluekitchen/btstack/port/nrf5-cinnamon/port/ll_nrf5.c
static void ll_connected_timer_handler(void);
static void lL_connected_rx_done(radio_result_t result);

static void ll_connected_connection_event_complete(void){
    radio_hf_clock_disable();
}

static void ll_connected_radio_stopped(radio_result_t result){
    UNUSED(result);
    ll_connected_connection_event_complete();
}

static void ll_connected_tx_only_done(radio_result_t result){
    UNUSED(result);
    ll_connected_connection_event_complete();
}

static void ll_connected_tx_to_rx_done(radio_result_t result) {
    UNUSED(result);
    if (!ll_connected_one_more_packet()){
        // stop tx
        radio_stop(&ll_connected_radio_stopped);
        return;
    }

    // receive next packet
    (void) ll_prepare_rx_buffer();
    if (ctx.rx_pdu == NULL){
        radio_stop(&ll_connected_radio_stopped);
        return;
    }

    // receive master packet
    radio_receive(&lL_connected_rx_done, TX_TO_RX_TIMEOUT_US, &ctx.rx_pdu->header, 2 + LL_MAX_PAYLOAD, NULL);
}

static void ll_connected_terminate_received(radio_result_t result){
    UNUSED(result);
    ll_connected_terminate(ERROR_CODE_REMOTE_USER_TERMINATED_CONNECTION);
}

static void lL_connected_rx_done(radio_result_t result){

    uint32_t packet_end_ticks = hal_timer_get_ticks();

    if (result == RADIO_RESULT_TIMEOUT){
        ll_connected_connection_event_complete();
        return;
    }

    // Handle RX

    // set anchor on first packet in connection event
    if (ctx.packet_nr_in_connection_event == 0){
        ctx.anchor_ticks = ll_start_ticks_for_end_time_and_len(packet_end_ticks, ctx.rx_pdu->len);
        ctx.synced = true;

        // set timer for sync-hop
        hal_timer_set_callback(&ll_connected_timer_handler);
        ll_set_timer_ticks( ctx.conn_sync_hop_ticks);
    }

    // packet received
    if (result == RADIO_RESULT_OK) {

        // parse rx pdu header
        uint8_t rx_header = ctx.rx_pdu->header;
        uint8_t next_expected_sequence_number = (rx_header >> 2) & 1;
        uint8_t sequence_number = (rx_header >> 3) & 1;
        uint8_t more_data = (rx_header >> 4) & 1;

        // remote active if md or len > 0
        ctx.remote_active = (more_data != 0) || ctx.rx_pdu->len > 0;

        // only accept packets with new sequence number and  len <= payload size
        if ((sequence_number == ctx.next_expected_sequence_number) && (ctx.rx_pdu->len <= LL_MAX_PAYLOAD)) {

            // update state
            ctx.next_expected_sequence_number = 1 - sequence_number;

            // queue if not empty
            ll_pdu_t *rx_packet = ctx.rx_pdu;
            if (rx_packet->len != 0) {

                // handle terminate immediately
                uint8_t ll_id = rx_packet->header & 3;
                if (ll_id == PDU_DATA_LLID_CTRL) {
                    if (rx_packet->payload[0] == PDU_DATA_LLCTRL_TYPE_TERMINATE_IND){
                        ll_stop_timer();
                        radio_stop(&ll_connected_terminate_received);
                        return;
                    }
                }

                // packet used
                ctx.rx_pdu = NULL;

                // mark as data packet and add meta data
                rx_packet->flags |= LL_PDU_FLAG_DATA_PDU;
                rx_packet->connection_event = ctx.connection_event;
                rx_packet->packet_nr = ctx.packet_nr_in_connection_event;

                // queue received packet
                btstack_linked_queue_enqueue(&ctx.rx_queue, (btstack_linked_item_t *) rx_packet);
            }
        }

        ctx.packet_nr_in_connection_event++;

        // report outgoing packet as ack'ed and free if confirmed by peer
        bool tx_acked = ctx.transmit_sequence_number != next_expected_sequence_number;
        if (tx_acked) {
            // if non link-layer packet, free buffer and report as completed
            if ((ctx.tx_pdu != NULL) && (ctx.tx_pdu != &ll_tx_packet)) {
                btstack_memory_ll_pdu_free(ctx.tx_pdu);
                ctx.num_completed++;
            }
            ctx.tx_pdu = NULL;
            ctx.transmit_sequence_number = next_expected_sequence_number;
        }
    }

    // restart supervision timeout
    ctx.time_without_any_packets_us = 0;

    // Prepare TX

    // check if we can sent a full packet before sync hop
    if (!ll_connected_one_more_packet()){
        // stop tx
        radio_stop(&ll_connected_radio_stopped);
        return;
    }

    // fetch next packet
    if (ctx.tx_pdu == NULL){
        ctx.tx_pdu = (ll_pdu_t *) btstack_linked_queue_dequeue(&ctx.tx_queue);
    }

    // setup empty packet if no tx packet ready
    uint8_t * tx_buffer;
    if (ctx.tx_pdu == NULL){
        ll_empty_pdu[0] = PDU_DATA_LLID_DATA_CONTINUE;
        ll_empty_pdu[1] = 0;
        tx_buffer = ll_empty_pdu;
    } else {
        tx_buffer = &ctx.tx_pdu->header;
    }

    // setup pdu header
    uint8_t md = btstack_linked_queue_empty(&ctx.tx_queue) ? 0 : 1;
    tx_buffer[0] |= (md << 4) | (ctx.transmit_sequence_number << 3) | (ctx.next_expected_sequence_number << 2);

    // send packet
    bool tx_to_rx = ctx.remote_active || (tx_buffer[1] > 0);
    if (tx_to_rx){
        radio_transmit(&ll_connected_tx_to_rx_done, RADIO_TRANSITION_TX_TO_RX, tx_buffer, 2 + tx_buffer[1]);
    } else {
        radio_transmit(&ll_connected_tx_only_done, RADIO_TRANSITION_TX_ONLY, tx_buffer, 2 + tx_buffer[1]);
    }
}

static void ll_connected_handle_conn_ind(ll_pdu_t * rx_packet){
    // parse packet
    uint8_t * init_addr = &rx_packet->payload[0];
    uint8_t * adv_addr =  &rx_packet->payload[6];
    uint8_t   chan_sel = (rx_packet->header >> 5) & 1;

    // verify AdvA
    if (memcmp(ctx.bd_addr_le, adv_addr, 6) != 0){
        // differs, go back to adv sending
        ll_advertising_statemachine();
        return;
    }

    // next event is > 1.25 ms away
    radio_hf_clock_disable();

    // TODO: get remote addr type
    ctx.peer_addr_type = 0;
    memcpy(ctx.peer_addr, init_addr, 6);

    // get params for HCI event
    const uint8_t * ll_data = &rx_packet->payload[12];

    ctx.aa                          = little_endian_read_32(ll_data, 0);
    uint32_t crc_init               = little_endian_read_24(ll_data, 4);
    uint8_t  transmit_window_size   = ll_data[7];
    uint16_t transmit_window_offset = little_endian_read_16(ll_data, 8);
    uint16_t conn_interval_1250us   = little_endian_read_16(ll_data, 10);
    ctx.conn_latency                = little_endian_read_16(ll_data, 12);
    ctx.supervision_timeout_10ms    = little_endian_read_16(ll_data, 14);
    const uint8_t * channel_map = &ll_data[16];
    uint8_t hop = ll_data[21] & 0x1f;
    uint8_t sca = ll_data[21] >> 5;

    // TODO: handle sleep clock accuracy of initiator
    UNUSED(sca);

    ll_connected_ctx_set_conn_interval(conn_interval_1250us);

    // convert to us
    ctx.supervision_timeout_us    = ctx.supervision_timeout_10ms  * 10000;
    ctx.transmit_window_size_us   = transmit_window_size   * 1250;
    ctx.transmit_window_offset_us = transmit_window_offset * 1250;

    // init connection state
    ctx.connection_event = 0;
    ctx.packet_nr_in_connection_event = 0;
    ctx.next_expected_sequence_number = 0;
    ctx.transmit_sequence_number = 0;

    // set AA
    radio_set_access_address(ctx.aa);

    // set CRC init value
    radio_set_crc_init(crc_init);

