bluekitchen/btstack/port/nrf5-cinnamon/port/ll_nrf5.c
    printf("Transmit window offset %u us\n", (int) ctx.transmit_window_offset_us);
    printf("Transmit window size   %u us\n", (int) ctx.transmit_window_size_us);
    printf("Connection interval    %u us\n", (int) ctx.conn_interval_us);
    printf("Connection timeout     %u us\n", (int) ctx.supervision_timeout_us);
    printf("AA %08x\n", (int) ctx.aa);
    printf("CRC Init 0x%06" PRIx32 "x\n", crc_init);

    // init hopping
    hopping_init( &h );
    hopping_set_channel_map( &h, channel_map);
    ctx.channel_selection_algorithm = ctx.csa2_support & chan_sel;
    switch (ctx.channel_selection_algorithm){
        case 0:
            hopping_csa1_set_hop_increment(  &h, hop );
            break;
        case 1:
            hopping_csa2_set_access_address( &h, ctx.aa);
            break;
        default:
            break;
    }

    // connected -> notify controller
    ll_state = LL_STATE_CONNECTED;
    ctx.synced = false;
    ctx.ll_send_connection_complete = true;

    // sleep until transmit window
    hal_timer_set_callback(&ll_connected_timer_handler);
    ctx.anchor_delta_ticks = US_TO_TICKS(ctx.transmit_window_offset_us + 1250);
    ll_set_timer_ticks(US_TO_TICKS(ctx.transmit_window_offset_us + 1250 - SYNC_HOP_DELAY_US));
}

static void ll_connected_timer_handler(void){

    // Check supervision timeout
    if (ctx.synced){
        // check supervision timeout if connection was established
        ctx.time_without_any_packets_us += ctx.conn_interval_us;
        if (ctx.time_without_any_packets_us > ctx.supervision_timeout_us) {
            printf("Supervision timeout (regular)\n\n");
            ll_connected_terminate(ERROR_CODE_CONNECTION_TIMEOUT);
            return;
        }
    } else {
        // give up on receiving first packet after 6 tries
        if (ctx.connection_event > 6){
            printf("Supervision timeout(establishment)\n\n");
            ll_connected_terminate(ERROR_CODE_CONNECTION_FAILED_TO_BE_ESTABLISHED);
            return;
        }
    }

    // update anchor using custom value when transmit windows was used
    // connection event counter is only incremented for regular connection interval
    if (ctx.anchor_delta_ticks == 0){
        ctx.anchor_ticks += ctx.conn_interval_ticks;
        ctx.connection_event++;
    } else {
        ctx.anchor_ticks += ctx.anchor_delta_ticks;
        ctx.anchor_delta_ticks = 0;
    }

    if (ctx.channel_map_update_pending && (ctx.channel_map_update_instant == ctx.connection_event)) {
        ctx.channel_map_update_pending = false;

        log_info("Chan map update now");

        hopping_set_channel_map( &h, (const uint8_t *) &ctx.channel_map_update_map );
    }

    if (ctx.conn_param_update_pending && ((ctx.conn_param_update_instant) == ctx.connection_event) ) {
        ctx.conn_param_update_pending = false;

        log_info("Conn param update now");

        ll_connected_ctx_set_conn_interval(ctx.conn_param_update_interval_1250us);
        ctx.conn_latency              = ctx.conn_param_update_latency;
        ctx.supervision_timeout_us    = ctx.conn_param_update_timeout_us;
        ctx.transmit_window_offset_us = ctx.conn_param_update_win_offset * 1250;
        ctx.transmit_window_size_us   = ctx.conn_param_update_win_size   * 1250;
        ctx.synced = false;

        // See Core V5.2, Vol 6B, 5.1.1, Figure 5.1
        // if transmit window == 0, continue. If not sleep again
        if (ctx.conn_param_update_win_offset > 0){
            ctx.anchor_delta_ticks = US_TO_TICKS(ctx.transmit_window_offset_us);
            ll_set_timer_ticks(US_TO_TICKS(ctx.transmit_window_offset_us - SYNC_HOP_DELAY_US));
            return;
        }
    }

    // prepare connection event
    ctx.packet_nr_in_connection_event = 0;

    radio_hf_clock_enable(true);

    ll_connected_next_channel();

    // set radio timer (should get updated by first packet)
    ll_set_timer_ticks( ctx.conn_sync_hop_ticks);

    (void) ll_prepare_rx_buffer();
    if (ctx.rx_pdu == NULL) {
        log_info("No RX PDU  for first packet, skip connection event");
    } else {
        if (ctx.synced){
            radio_receive(&lL_connected_rx_done, SYNC_HOP_DELAY_US + 100, &ctx.rx_pdu->header, 2 + LL_MAX_PAYLOAD, NULL);
        } else {
            radio_receive(&lL_connected_rx_done, SYNC_HOP_DELAY_US + ctx.transmit_window_size_us, &ctx.rx_pdu->header, 2 + LL_MAX_PAYLOAD, NULL);
        }
    }

    // printf("--SYNC-Ch %02u-Event %04u - t %08" PRIu32 "--\n", ctx.channel, ctx.connection_event, t0);
}

static void ll_connected_handle_control(ll_pdu_t * rx_packet){
    ll_pdu_t * tx_packet = &ll_tx_packet;
    uint8_t opcode = rx_packet->payload[0];
    switch (opcode){
        case PDU_DATA_LLCTRL_TYPE_VERSION_IND:
            tx_packet->len = 6;
            tx_packet->header = PDU_DATA_LLID_CTRL;
            tx_packet->payload[0] = PDU_DATA_LLCTRL_TYPE_VERSION_IND;
            tx_packet->payload[1] = 0x06; // VersNr = Bluetooth Core V4.0
            little_endian_store_16(tx_packet->payload, 2, BLUETOOTH_COMPANY_ID_BLUEKITCHEN_GMBH);
            little_endian_store_16(tx_packet->payload, 4, 0);
            btstack_linked_queue_enqueue(&ctx.tx_queue, (btstack_linked_item_t *) tx_packet);
            printf("Queue Version Ind\n");
            break;
        case PDU_DATA_LLCTRL_TYPE_FEATURE_REQ:
            tx_packet->len = 9;
            tx_packet->header = PDU_DATA_LLID_CTRL;
            tx_packet->payload[0] = PDU_DATA_LLCTRL_TYPE_FEATURE_RSP;
            // TODO: set features of our controller
            memset(&tx_packet->payload[1], 0, 8);
            btstack_linked_queue_enqueue(&ctx.tx_queue, (btstack_linked_item_t *) tx_packet);
            printf("Queue Feature Rsp\n");
            break;
        case PDU_DATA_LLCTRL_TYPE_CHAN_MAP_IND:
            memcpy((uint8_t *) ctx.channel_map_update_map, &rx_packet->payload[1], 5);
            ctx.channel_map_update_instant   = little_endian_read_16(rx_packet->payload, 6);
            ctx.channel_map_update_pending   = true;
            break;
        case PDU_DATA_LLCTRL_TYPE_CONN_UPDATE_IND:
            ctx.conn_param_update_win_size        = rx_packet->payload[1];
            ctx.conn_param_update_win_offset      = little_endian_read_16(rx_packet->payload, 2);
            ctx.conn_param_update_interval_1250us = little_endian_read_16(rx_packet->payload, 4);
            ctx.conn_param_update_latency         = little_endian_read_16(rx_packet->payload, 6);
            ctx.conn_param_update_timeout_us      = little_endian_read_16(rx_packet->payload, 8) * 10000;
            ctx.conn_param_update_instant         = little_endian_read_16(rx_packet->payload, 10);
            ctx.conn_param_update_pending         = true;
            log_info("PDU_DATA_LLCTRL_TYPE_CONN_UPDATE_IND, conn interval %u 1250us at instant %u",
                     (unsigned int) ctx.conn_param_update_interval_1250us, ctx.conn_param_update_instant);
            break;
        default:
            break;
    }
}

static void ll_connected_handle_data(ll_pdu_t * rx_packet){
    btstack_assert(rx_packet->len <= LL_MAX_PAYLOAD);
    log_debug("CE: %u, nr %u, header 0x%02x, len %u", rx_packet->connection_event, rx_packet->packet_nr, rx_packet->header, rx_packet->len);
    uint8_t acl_packet[4 + LL_MAX_PAYLOAD];
    // ACL Header
    uint8_t ll_id = rx_packet->header & 3;
    acl_packet[0] = 0x01;
    acl_packet[1] = ll_id << 4;
    little_endian_store_16(acl_packet, 2, rx_packet->len);
    memcpy(&acl_packet[4], rx_packet->payload, rx_packet->len);
    (*controller_packet_handler)(HCI_ACL_DATA_PACKET, acl_packet, rx_packet->len + 4);
}

static void ll_handle_adv(ll_pdu_t * rx_packet) {
    // Map PDU_ADV_TYPE to HCI Event_Type
    uint8_t event_type = 0;
    switch (rx_packet->header & 0x0f){
        case PDU_ADV_TYPE_ADV_IND:
            event_type = 0;
            break;
        case PDU_ADV_TYPE_DIRECT_IND:
            event_type = 1;
            break;
        case PDU_ADV_TYPE_NONCONN_IND:
            event_type = 3;
            break;
        case PDU_ADV_TYPE_SCAN_RSP:
            event_type = 3;
            break;
        default:
            return;
    }
    uint8_t advertiser_addr_type = ((rx_packet->header & 0x40) != 0) ? 1 : 0;
    uint8_t adv_data_len = rx_packet->len - 6;

    uint16_t pos = 0;
    ll_outgoing_hci_event[pos++] = HCI_EVENT_LE_META;
    pos++;
    ll_outgoing_hci_event[pos++] = HCI_SUBEVENT_LE_ADVERTISING_REPORT;
    ll_outgoing_hci_event[pos++] = 1;
    ll_outgoing_hci_event[pos++] = event_type;
    ll_outgoing_hci_event[pos++] = advertiser_addr_type;
    memcpy(&ll_outgoing_hci_event[pos], &rx_packet->payload[0], 6);
    pos += 6;
    ll_outgoing_hci_event[pos++] = adv_data_len;
    memcpy(&ll_outgoing_hci_event[pos], &rx_packet->payload[6], adv_data_len);
    pos += adv_data_len;
    ll_outgoing_hci_event[pos++] = (uint8_t) rx_packet->rssi;
    ll_outgoing_hci_event[1] = pos - 2;
    (*controller_packet_handler)(HCI_EVENT_PACKET, ll_outgoing_hci_event, pos);
}

// public API

void ll_init(void){
    // setup memory pools
    btstack_memory_pool_create(&ll_pdu_pool, ll_pdu_pool_storage, MAX_NUM_LL_PDUS, sizeof(ll_pdu_t));

    // set test bd addr 33:33:33:33:33:33
    memset(ctx.bd_addr_le, 0x33, 6);

    // default channels, advertising interval
    ctx.adv_map = 0x7;
    ctx.adv_interval_us = 1280000;

