bluekitchen/btstack/port/nrf5-cinnamon/port/ll_nrf5.c
    // init radio
    radio_init();
}

void ll_radio_on(void){
    ll_state = LL_STATE_STANDBY;
}

void ll_set_scan_parameters(uint8_t le_scan_type, uint16_t le_scan_interval, uint16_t le_scan_window, uint8_t own_address_type, uint8_t scanning_filter_policy){
    // TODO .. store other params
    ll_scan_interval_us = ((uint32_t) le_scan_interval) * 625;
    ll_scan_window_us   = ((uint32_t) le_scan_window)   * 625;
    log_info("LE Scan Params: window %lu, interval %lu ms", ll_scan_interval_us, ll_scan_window_us);
}

uint8_t ll_set_scan_enable(uint8_t le_scan_enable, uint8_t filter_duplicates){
    if (le_scan_enable){
        return ll_scanning_start(filter_duplicates);
    } else {
        return ll_scanning_stop();
    }
}

uint8_t ll_set_advertise_enable(uint8_t le_adv_enable){
    if (le_adv_enable){
        return ll_advertising_start();
    } else {
        return ll_advertising_stop();
    }
}

uint8_t ll_set_advertising_parameters(uint16_t advertising_interval_min, uint16_t advertising_interval_max,
                                      uint8_t advertising_type, uint8_t own_address_type, uint8_t peer_address_types, uint8_t * peer_address,
                                      uint8_t advertising_channel_map, uint8_t advertising_filter_policy){

    // validate channel map
    if (advertising_channel_map == 0) return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;
    if ((advertising_channel_map & 0xf8) != 0) return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;

    // validate advertising interval
    if (advertising_interval_min < 0x20)   return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;
    if (advertising_interval_min > 0x4000) return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;
    if (advertising_interval_max < 0x20)   return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;
    if (advertising_interval_max > 0x4000) return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;
    if (advertising_interval_min > advertising_interval_max) return ERROR_CODE_INVALID_HCI_COMMAND_PARAMETERS;

    ctx.adv_map = advertising_channel_map;
    ctx.adv_interval_us = advertising_interval_max * 625;
    ctx.adv_type= advertising_type;

    // TODO: validate other params
    // TODO: process other params

    return ERROR_CODE_SUCCESS;
}

uint8_t ll_set_advertising_data(uint8_t adv_len, const uint8_t * adv_data){
    // COMMAND DISALLOWED if wrong state.
    if (ll_state == LL_STATE_ADVERTISING) return ERROR_CODE_COMMAND_DISALLOWED;
    if (adv_len > 31) return ERROR_CODE_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE;
    ctx.adv_len = adv_len;
    memcpy(ctx.adv_data, adv_data, adv_len);

    return ERROR_CODE_SUCCESS;
}

uint8_t ll_set_scan_response_data(uint8_t adv_len, const uint8_t * adv_data){
    // COMMAND DISALLOWED if wrong state.
    if (ll_state == LL_STATE_ADVERTISING) return ERROR_CODE_COMMAND_DISALLOWED;
    if (adv_len > 31) return ERROR_CODE_UNSUPPORTED_FEATURE_OR_PARAMETER_VALUE;
    ctx.scan_resp_len = adv_len;
    memcpy(ctx.scan_resp_data, adv_data, adv_len);

    return ERROR_CODE_SUCCESS;
}

void ll_execute_once(void){
    // process received packets
    while (1){
        ll_pdu_t * rx_packet;
        /** critical section start */
        hal_cpu_disable_irqs();
        rx_packet = (ll_pdu_t *) btstack_linked_queue_dequeue(&ctx.rx_queue);
        hal_cpu_enable_irqs();
        /** critical section end */
        if (rx_packet == NULL) break;
        uint8_t ll_id;
        if (rx_packet->len > 0){
            switch (ll_state){
                case LL_STATE_ADVERTISING:
                    if ((rx_packet->flags & LL_PDU_FLAG_DATA_PDU) != 0){
                        break;
                    }
                    if ((rx_packet->header & 0x0f) != PDU_ADV_TYPE_CONNECT_IND) {
                        break;
                    }
                    ll_connected_handle_conn_ind(rx_packet);
                    break;
                case LL_STATE_SCANNING:
                    if ((rx_packet->flags & LL_PDU_FLAG_DATA_PDU) != 0){
                        break;
                    }
                    ll_handle_adv(rx_packet);
                    break;
                case LL_STATE_CONNECTED:
                    // DATA PDU
                    if ((rx_packet->flags & LL_PDU_FLAG_DATA_PDU) == 0){
                        break;
                    }
                    ll_id = rx_packet->header & 3;
                    if (ll_id == PDU_DATA_LLID_CTRL) {
                        ll_connected_handle_control(rx_packet);
                    } else {
                        ll_connected_handle_data(rx_packet);
                    }
                    break;
                default:
                    break;
            }
        }
        // free packet
        /** critical section start */
        hal_cpu_disable_irqs();
        btstack_memory_ll_pdu_free(rx_packet);
        hal_cpu_enable_irqs();
        /** critical section end */
    }

    // generate HCI events

    // report num complete packets
    /** critical section start */
    hal_cpu_disable_irqs();
    uint8_t num_completed = ctx.num_completed;
    ctx.num_completed = 0;
    hal_cpu_enable_irqs();
    /** critical section end */
    if (num_completed > 0){
        ll_emit_hci_event(&hci_event_number_of_completed_packets_1, 1, HCI_CON_HANDLE, num_completed);
    }

    // report connection event
    if (ctx.ll_send_connection_complete){
        ctx.ll_send_connection_complete = false;
        ll_emit_hci_event(&hci_subevent_le_connection_complete,
                          ERROR_CODE_SUCCESS, HCI_CON_HANDLE, 0x01 /* slave */, ctx.peer_addr_type, ctx.peer_addr,
                          ctx.conn_interval_1250us, ctx.conn_latency, ctx.supervision_timeout_10ms, 0 /* master clock accuracy */);
    }

    // report disconnection event
    if (ctx.ll_send_disconnected){
        ctx.ll_send_disconnected = false;
        uint8_t error_code = ctx.error_code;
        ctx.error_code = ERROR_CODE_SUCCESS;
        ll_emit_hci_event(&hci_event_disconnection_complete, ERROR_CODE_SUCCESS, HCI_CON_HANDLE, error_code);
    }
}

bool ll_reserve_acl_packet(void){
    if (ll_reserved_acl_buffer == NULL){

        /** critical section start */
        hal_cpu_disable_irqs();
        ll_reserved_acl_buffer = btstack_memory_ll_pdu_get();
        hal_cpu_enable_irqs();
        /** critical section end */

    }
    return ll_reserved_acl_buffer != NULL;
}

void ll_queue_acl_packet(const uint8_t * packet, uint16_t size){
    btstack_assert(ll_reserved_acl_buffer != NULL);

    ll_pdu_t * tx_packet = ll_reserved_acl_buffer;
    ll_reserved_acl_buffer = NULL;

    switch ((packet[1] >> 4) & 0x03){
        case 0:
        case 2:
            tx_packet->header = PDU_DATA_LLID_DATA_START;
            break;
        case 1:
            tx_packet->header = PDU_DATA_LLID_DATA_CONTINUE;
            break;
        case 3:
            while(1);
            break;
        default:
            break;
    }
    tx_packet->len = size - 4;
    memcpy(tx_packet->payload, &packet[4], size - 4);

    /** critical section start */
    hal_cpu_disable_irqs();
    btstack_linked_queue_enqueue(&ctx.tx_queue, (btstack_linked_item_t *) tx_packet);
    hal_cpu_enable_irqs();
    /** critical section end */
}

void ll_register_packet_handler(void (*packet_handler)(uint8_t packet_type, uint8_t * packet, uint16_t size)){
    controller_packet_handler = packet_handler;
}
